Revit 2027 API
FabricationNetworkChangeService.GetPartTypesforMapping Method
 Get a set of element identifiers of fabrication part types that can be mapped.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetPartTypesforMapping()
Public Function GetPartTypesforMapping As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetPartTypesforMapping()
member GetPartTypesforMapping : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
 Returns the set of element identifiers for part types or an empty set if there are none.
See Also
Reference
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace